ClearDotX/MAPS-KS22F256/LinDemo/mcu-sdk-2.0-lin-demo/platform/devices/MKV56F22/MKV56F22_features.h
/*
** ###################################################################
**     Version:             rev. 0.3, 2015-06-08
**     Build:               b151106
**
**     Abstract:
**         Chip specific module features.
**
**     Copyright (c) 2015 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 0.1 (2015-02-24)
**         Initial version.
**     - rev. 0.2 (2015-05-25)
**         Added FSL_FEATURE_FLASH_PFLASH_START_ADDRESS
**     - rev. 0.3 (2015-06-08)
**         FTM features BUS_CLOCK and FAST_CLOCK removed.
**
** ###################################################################
*/

#ifndef _MKV56F22_FEATURES_H_
#define _MKV56F22_FEATURES_H_

/* SOC module features */

#if defined(CPU_MKV56F1M0VLQ22) || defined(CPU_MKV56F512VLQ22) || defined(CPU_MKV56F1M0VMD22) || defined(CPU_MKV56F512VMD22)
    /* @brief ACMP availability on the SoC. */
    #define FSL_FEATURE_SOC_ACMP_COUNT (0)
    /* @brief ADC16 availability on the SoC. */
    #define FSL_FEATURE_SOC_ADC16_COUNT (1)
    /* @brief ADC12 availability on the SoC. */
    #define FSL_FEATURE_SOC_ADC12_COUNT (0)
    /* @brief AFE availability on the SoC. */
    #define FSL_FEATURE_SOC_AFE_COUNT (0)
    /* @brief AIPS availability on the SoC. */
    #define FSL_FEATURE_SOC_AIPS_COUNT (2)
    /* @brief AOI availability on the SoC. */
    #define FSL_FEATURE_SOC_AOI_COUNT (1)
    /* @brief AXBS availability on the SoC. */
    #define FSL_FEATURE_SOC_AXBS_COUNT (1)
    /* @brief ASMC availability on the SoC. */
    #define FSL_FEATURE_SOC_ASMC_COUNT (0)
    /* @brief CADC availability on the SoC. */
    #define FSL_FEATURE_SOC_CADC_COUNT (0)
    /* @brief FLEXCAN availability on the SoC. */
    #define FSL_FEATURE_SOC_FLEXCAN_COUNT (2)
    /* @brief MMCAU availability on the SoC. */
    #define FSL_FEATURE_SOC_MMCAU_COUNT (1)
    /* @brief CMP availability on the SoC. */
    #define FSL_FEATURE_SOC_CMP_COUNT (4)
    /* @brief CMT availability on the SoC. */
    #define FSL_FEATURE_SOC_CMT_COUNT (0)
    /* @brief CNC availability on the SoC. */
    #define FSL_FEATURE_SOC_CNC_COUNT (0)
    /* @brief CRC availability on the SoC. */
    #define FSL_FEATURE_SOC_CRC_COUNT (1)
    /* @brief DAC availability on the SoC. */
    #define FSL_FEATURE_SOC_DAC_COUNT (1)
    /* @brief DAC32 availability on the SoC. */
    #define FSL_FEATURE_SOC_DAC32_COUNT (0)
    /* @brief DCDC availability on the SoC. */
    #define FSL_FEATURE_SOC_DCDC_COUNT (0)
    /* @brief DDR availability on the SoC. */
    #define FSL_FEATURE_SOC_DDR_COUNT (0)
    /* @brief DMA availability on the SoC. */
    #define FSL_FEATURE_SOC_DMA_COUNT (0)
    /* @brief DMAMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_DMAMUX_COUNT (1)
    /* @brief DRY availability on the SoC. */
    #define FSL_FEATURE_SOC_DRY_COUNT (0)
    /* @brief DSPI availability on the SoC. */
    #define FSL_FEATURE_SOC_DSPI_COUNT (3)
    /* @brief EDMA availability on the SoC. */
    #define FSL_FEATURE_SOC_EDMA_COUNT (1)
    /* @brief EMVSIM availability on the SoC. */
    #define FSL_FEATURE_SOC_EMVSIM_COUNT (0)
    /* @brief ENC availability on the SoC. */
    #define FSL_FEATURE_SOC_ENC_COUNT (1)
    /* @brief ENET availability on the SoC. */
    #define FSL_FEATURE_SOC_ENET_COUNT (0)
    /* @brief EWM availability on the SoC. */
    #define FSL_FEATURE_SOC_EWM_COUNT (1)
    /* @brief FB availability on the SoC. */
    #define FSL_FEATURE_SOC_FB_COUNT (1)
    /* @brief FGPIO availability on the SoC. */
    #define FSL_FEATURE_SOC_FGPIO_COUNT (0)
    /* @brief FLEXIO availability on the SoC. */
    #define FSL_FEATURE_SOC_FLEXIO_COUNT (0)
    /* @brief FMC availability on the SoC. */
    #define FSL_FEATURE_SOC_FMC_COUNT (1)
    /* @brief FSKDT availability on the SoC. */
    #define FSL_FEATURE_SOC_FSKDT_COUNT (0)
    /* @brief FTFA availability on the SoC. */
    #define FSL_FEATURE_SOC_FTFA_COUNT (0)
    /* @brief FTFE availability on the SoC. */
    #define FSL_FEATURE_SOC_FTFE_COUNT (1)
    /* @brief FTFL availability on the SoC. */
    #define FSL_FEATURE_SOC_FTFL_COUNT (0)
    /* @brief FTM availability on the SoC. */
    #define FSL_FEATURE_SOC_FTM_COUNT (4)
    /* @brief FTMRA availability on the SoC. */
    #define FSL_FEATURE_SOC_FTMRA_COUNT (0)
    /* @brief FTMRE availability on the SoC. */
    #define FSL_FEATURE_SOC_FTMRE_COUNT (0)
    /* @brief FTMRH availability on the SoC. */
    #define FSL_FEATURE_SOC_FTMRH_COUNT (0)
    /* @brief GPIO availability on the SoC. */
    #define FSL_FEATURE_SOC_GPIO_COUNT (5)
    /* @brief HSADC availability on the SoC. */
    #define FSL_FEATURE_SOC_HSADC_COUNT (2)
    /* @brief I2C availability on the SoC. */
    #define FSL_FEATURE_SOC_I2C_COUNT (2)
    /* @brief I2S availability on the SoC. */
    #define FSL_FEATURE_SOC_I2S_COUNT (0)
    /* @brief ICS availability on the SoC. */
    #define FSL_FEATURE_SOC_ICS_COUNT (0)
    /* @brief IRQ availability on the SoC. */
    #define FSL_FEATURE_SOC_IRQ_COUNT (0)
    /* @brief INTMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_INTMUX_COUNT (0)
    /* @brief KBI availability on the SoC. */
    #define FSL_FEATURE_SOC_KBI_COUNT (0)
    /* @brief SLCD availability on the SoC. */
    #define FSL_FEATURE_SOC_SLCD_COUNT (0)
    /* @brief LCDC availability on the SoC. */
    #define FSL_FEATURE_SOC_LCDC_COUNT (0)
    /* @brief LDO availability on the SoC. */
    #define FSL_FEATURE_SOC_LDO_COUNT (0)
    /* @brief LLWU availability on the SoC. */
    #define FSL_FEATURE_SOC_LLWU_COUNT (1)
    /* @brief LMEM availability on the SoC. */
    #define FSL_FEATURE_SOC_LMEM_COUNT (0)
    /* @brief LPSCI availability on the SoC. */
    #define FSL_FEATURE_SOC_LPSCI_COUNT (0)
    /* @brief LPTMR availability on the SoC. */
    #define FSL_FEATURE_SOC_LPTMR_COUNT (1)
    /* @brief LPTPM availability on the SoC. */
    #define FSL_FEATURE_SOC_LPTPM_COUNT (0)
    /* @brief LPUART availability on the SoC. */
    #define FSL_FEATURE_SOC_LPUART_COUNT (0)
    /* @brief LTC availability on the SoC. */
    #define FSL_FEATURE_SOC_LTC_COUNT (0)
    /* @brief LPI2C availability on the SoC. */
    #define FSL_FEATURE_SOC_LPI2C_COUNT (0)
    /* @brief LPSPI availability on the SoC. */
    #define FSL_FEATURE_SOC_LPSPI_COUNT (0)
    /* @brief LPIT availability on the SoC. */
    #define FSL_FEATURE_SOC_LPIT_COUNT (0)
    /* @brief MC availability on the SoC. */
    #define FSL_FEATURE_SOC_MC_COUNT (0)
    /* @brief MCG availability on the SoC. */
    #define FSL_FEATURE_SOC_MCG_COUNT (1)
    /* @brief MCGLITE availability on the SoC. */
    #define FSL_FEATURE_SOC_MCGLITE_COUNT (0)
    /* @brief MCM availability on the SoC. */
    #define FSL_FEATURE_SOC_MCM_COUNT (1)
    /* @brief MMAU availability on the SoC. */
    #define FSL_FEATURE_SOC_MMAU_COUNT (0)
    /* @brief MMDVSQ availability on the SoC. */
    #define FSL_FEATURE_SOC_MMDVSQ_COUNT (0)
    /* @brief MPU availability on the SoC. */
    #define FSL_FEATURE_SOC_MPU_COUNT (1)
    /* @brief MSCAN availability on the SoC. */
    #define FSL_FEATURE_SOC_MSCAN_COUNT (0)
    /* @brief MSCM availability on the SoC. */
    #define FSL_FEATURE_SOC_MSCM_COUNT (1)
    /* @brief MTB availability on the SoC. */
    #define FSL_FEATURE_SOC_MTB_COUNT (0)
    /* @brief MTBDWT availability on the SoC. */
    #define FSL_FEATURE_SOC_MTBDWT_COUNT (0)
    /* @brief MU availability on the SoC. */
    #define FSL_FEATURE_SOC_MU_COUNT (0)
    /* @brief NFC availability on the SoC. */
    #define FSL_FEATURE_SOC_NFC_COUNT (0)
    /* @brief OPAMP availability on the SoC. */
    #define FSL_FEATURE_SOC_OPAMP_COUNT (0)
    /* @brief OSC availability on the SoC. */
    #define FSL_FEATURE_SOC_OSC_COUNT (1)
    /* @brief OSC32 availability on the SoC. */
    #define FSL_FEATURE_SOC_OSC32_COUNT (0)
    /* @brief OTFAD availability on the SoC. */
    #define FSL_FEATURE_SOC_OTFAD_COUNT (0)
    /* @brief PDB availability on the SoC. */
    #define FSL_FEATURE_SOC_PDB_COUNT (2)
    /* @brief PGA availability on the SoC. */
    #define FSL_FEATURE_SOC_PGA_COUNT (0)
    /* @brief PIT availability on the SoC. */
    #define FSL_FEATURE_SOC_PIT_COUNT (1)
    /* @brief PMC availability on the SoC. */
    #define FSL_FEATURE_SOC_PMC_COUNT (1)
    /* @brief PORT availability on the SoC. */
    #define FSL_FEATURE_SOC_PORT_COUNT (5)
    /* @brief PWM availability on the SoC. */
    #define FSL_FEATURE_SOC_PWM_COUNT (2)
    /* @brief PWT availability on the SoC. */
    #define FSL_FEATURE_SOC_PWT_COUNT (0)
    /* @brief PCC availability on the SoC. */
    #define FSL_FEATURE_SOC_PCC_COUNT (0)
    /* @brief QuadSPIO availability on the SoC. */
    #define FSL_FEATURE_SOC_QuadSPIO_COUNT (0)
    /* @brief RCM availability on the SoC. */
    #define FSL_FEATURE_SOC_RCM_COUNT (1)
    /* @brief RFSYS availability on the SoC. */
    #define FSL_FEATURE_SOC_RFSYS_COUNT (1)
    /* @brief RFVBAT availability on the SoC. */
    #define FSL_FEATURE_SOC_RFVBAT_COUNT (1)
    /* @brief RNG availability on the SoC. */
    #define FSL_FEATURE_SOC_RNG_COUNT (0)
    /* @brief RNGB availability on the SoC. */
    #define FSL_FEATURE_SOC_RNGB_COUNT (0)
    /* @brief ROM availability on the SoC. */
    #define FSL_FEATURE_SOC_ROM_COUNT (0)
    /* @brief RSIM availability on the SoC. */
    #define FSL_FEATURE_SOC_RSIM_COUNT (0)
    /* @brief RTC availability on the SoC. */
    #define FSL_FEATURE_SOC_RTC_COUNT (0)
    /* @brief SCI availability on the SoC. */
    #define FSL_FEATURE_SOC_SCI_COUNT (0)
    /* @brief SDHC availability on the SoC. */
    #define FSL_FEATURE_SOC_SDHC_COUNT (0)
    /* @brief SDRAM availability on the SoC. */
    #define FSL_FEATURE_SOC_SDRAM_COUNT (0)
    /* @brief SIM availability on the SoC. */
    #define FSL_FEATURE_SOC_SIM_COUNT (1)
    /* @brief SMC availability on the SoC. */
    #define FSL_FEATURE_SOC_SMC_COUNT (1)
    /* @brief SPI availability on the SoC. */
    #define FSL_FEATURE_SOC_SPI_COUNT (0)
    /* @brief SCG availability on the SoC. */
    #define FSL_FEATURE_SOC_SCG_COUNT (0)
    /* @brief SEMA42 availability on the SoC. */
    #define FSL_FEATURE_SOC_SEMA42_COUNT (0)
    /* @brief TMR availability on the SoC. */
    #define FSL_FEATURE_SOC_TMR_COUNT (0)
    /* @brief TPM availability on the SoC. */
    #define FSL_FEATURE_SOC_TPM_COUNT (0)
    /* @brief TRIAMP availability on the SoC. */
    #define FSL_FEATURE_SOC_TRIAMP_COUNT (0)
    /* @brief TRNG availability on the SoC. */
    #define FSL_FEATURE_SOC_TRNG_COUNT (1)
    /* @brief TSI availability on the SoC. */
    #define FSL_FEATURE_SOC_TSI_COUNT (0)
    /* @brief TRGMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_TRGMUX_COUNT (0)
    /* @brief TSTMR availability on the SoC. */
    #define FSL_FEATURE_SOC_TSTMR_COUNT (0)
    /* @brief UART availability on the SoC. */
    #define FSL_FEATURE_SOC_UART_COUNT (6)
    /* @brief USB availability on the SoC. */
    #define FSL_FEATURE_SOC_USB_COUNT (0)
    /* @brief USBDCD availability on the SoC. */
    #define FSL_FEATURE_SOC_USBDCD_COUNT (0)
    /* @brief USBHSDCD availability on the SoC. */
    #define FSL_FEATURE_SOC_USBHSDCD_COUNT (0)
    /* @brief USBPHY availability on the SoC. */
    #define FSL_FEATURE_SOC_USBPHY_COUNT (0)
    /* @brief VREF availability on the SoC. */
    #define FSL_FEATURE_SOC_VREF_COUNT (0)
    /* @brief WDOG availability on the SoC. */
    #define FSL_FEATURE_SOC_WDOG_COUNT (1)
    /* @brief XBAR availability on the SoC. */
    #define FSL_FEATURE_SOC_XBAR_COUNT (2)
    /* @brief XCVR availability on the SoC. */
    #define FSL_FEATURE_SOC_XCVR_COUNT (0)
    /* @brief XRDC availability on the SoC. */
    #define FSL_FEATURE_SOC_XRDC_COUNT (0)
    /* @brief ZLL availability on the SoC. */
    #define FSL_FEATURE_SOC_ZLL_COUNT (0)
#elif defined(CPU_MKV56F1M0VLL22) || defined(CPU_MKV56F512VLL22)
    /* @brief ACMP availability on the SoC. */
    #define FSL_FEATURE_SOC_ACMP_COUNT (0)
    /* @brief ADC16 availability on the SoC. */
    #define FSL_FEATURE_SOC_ADC16_COUNT (1)
    /* @brief ADC12 availability on the SoC. */
    #define FSL_FEATURE_SOC_ADC12_COUNT (0)
    /* @brief AFE availability on the SoC. */
    #define FSL_FEATURE_SOC_AFE_COUNT (0)
    /* @brief AIPS availability on the SoC. */
    #define FSL_FEATURE_SOC_AIPS_COUNT (2)
    /* @brief AOI availability on the SoC. */
    #define FSL_FEATURE_SOC_AOI_COUNT (1)
    /* @brief AXBS availability on the SoC. */
    #define FSL_FEATURE_SOC_AXBS_COUNT (1)
    /* @brief ASMC availability on the SoC. */
    #define FSL_FEATURE_SOC_ASMC_COUNT (0)
    /* @brief CADC availability on the SoC. */
    #define FSL_FEATURE_SOC_CADC_COUNT (0)
    /* @brief FLEXCAN availability on the SoC. */
    #define FSL_FEATURE_SOC_FLEXCAN_COUNT (2)
    /* @brief MMCAU availability on the SoC. */
    #define FSL_FEATURE_SOC_MMCAU_COUNT (1)
    /* @brief CMP availability on the SoC. */
    #define FSL_FEATURE_SOC_CMP_COUNT (4)
    /* @brief CMT availability on the SoC. */
    #define FSL_FEATURE_SOC_CMT_COUNT (0)
    /* @brief CNC availability on the SoC. */
    #define FSL_FEATURE_SOC_CNC_COUNT (0)
    /* @brief CRC availability on the SoC. */
    #define FSL_FEATURE_SOC_CRC_COUNT (1)
    /* @brief DAC availability on the SoC. */
    #define FSL_FEATURE_SOC_DAC_COUNT (1)
    /* @brief DAC32 availability on the SoC. */
    #define FSL_FEATURE_SOC_DAC32_COUNT (0)
    /* @brief DCDC availability on the SoC. */
    #define FSL_FEATURE_SOC_DCDC_COUNT (0)
    /* @brief DDR availability on the SoC. */
    #define FSL_FEATURE_SOC_DDR_COUNT (0)
    /* @brief DMA availability on the SoC. */
    #define FSL_FEATURE_SOC_DMA_COUNT (0)
    /* @brief DMAMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_DMAMUX_COUNT (1)
    /* @brief DRY availability on the SoC. */
    #define FSL_FEATURE_SOC_DRY_COUNT (0)
    /* @brief DSPI availability on the SoC. */
    #define FSL_FEATURE_SOC_DSPI_COUNT (3)
    /* @brief EDMA availability on the SoC. */
    #define FSL_FEATURE_SOC_EDMA_COUNT (1)
    /* @brief EMVSIM availability on the SoC. */
    #define FSL_FEATURE_SOC_EMVSIM_COUNT (0)
    /* @brief ENC availability on the SoC. */
    #define FSL_FEATURE_SOC_ENC_COUNT (1)
    /* @brief ENET availability on the SoC. */
    #define FSL_FEATURE_SOC_ENET_COUNT (0)
    /* @brief EWM availability on the SoC. */
    #define FSL_FEATURE_SOC_EWM_COUNT (1)
    /* @brief FB availability on the SoC. */
    #define FSL_FEATURE_SOC_FB_COUNT (1)
    /* @brief FGPIO availability on the SoC. */
    #define FSL_FEATURE_SOC_FGPIO_COUNT (0)
    /* @brief FLEXIO availability on the SoC. */
    #define FSL_FEATURE_SOC_FLEXIO_COUNT (0)
    /* @brief FMC availability on the SoC. */
    #define FSL_FEATURE_SOC_FMC_COUNT (1)
    /* @brief FSKDT availability on the SoC. */
    #define FSL_FEATURE_SOC_FSKDT_COUNT (0)
    /* @brief FTFA availability on the SoC. */
    #define FSL_FEATURE_SOC_FTFA_COUNT (0)
    /* @brief FTFE availability on the SoC. */
    #define FSL_FEATURE_SOC_FTFE_COUNT (1)
    /* @brief FTFL availability on the SoC. */
    #define FSL_FEATURE_SOC_FTFL_COUNT (0)
    /* @brief FTM availability on the SoC. */
    #define FSL_FEATURE_SOC_FTM_COUNT (4)
    /* @brief FTMRA availability on the SoC. */
    #define FSL_FEATURE_SOC_FTMRA_COUNT (0)
    /* @brief FTMRE availability on the SoC. */
    #define FSL_FEATURE_SOC_FTMRE_COUNT (0)
    /* @brief FTMRH availability on the SoC. */
    #define FSL_FEATURE_SOC_FTMRH_COUNT (0)
    /* @brief GPIO availability on the SoC. */
    #define FSL_FEATURE_SOC_GPIO_COUNT (5)
    /* @brief HSADC availability on the SoC. */
    #define FSL_FEATURE_SOC_HSADC_COUNT (2)
    /* @brief I2C availability on the SoC. */
    #define FSL_FEATURE_SOC_I2C_COUNT (2)
    /* @brief I2S availability on the SoC. */
    #define FSL_FEATURE_SOC_I2S_COUNT (0)
    /* @brief ICS availability on the SoC. */
    #define FSL_FEATURE_SOC_ICS_COUNT (0)
    /* @brief IRQ availability on the SoC. */
    #define FSL_FEATURE_SOC_IRQ_COUNT (0)
    /* @brief INTMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_INTMUX_COUNT (0)
    /* @brief KBI availability on the SoC. */
    #define FSL_FEATURE_SOC_KBI_COUNT (0)
    /* @brief SLCD availability on the SoC. */
    #define FSL_FEATURE_SOC_SLCD_COUNT (0)
    /* @brief LCDC availability on the SoC. */
    #define FSL_FEATURE_SOC_LCDC_COUNT (0)
    /* @brief LDO availability on the SoC. */
    #define FSL_FEATURE_SOC_LDO_COUNT (0)
    /* @brief LLWU availability on the SoC. */
    #define FSL_FEATURE_SOC_LLWU_COUNT (1)
    /* @brief LMEM availability on the SoC. */
    #define FSL_FEATURE_SOC_LMEM_COUNT (0)
    /* @brief LPSCI availability on the SoC. */
    #define FSL_FEATURE_SOC_LPSCI_COUNT (0)
    /* @brief LPTMR availability on the SoC. */
    #define FSL_FEATURE_SOC_LPTMR_COUNT (1)
    /* @brief LPTPM availability on the SoC. */
    #define FSL_FEATURE_SOC_LPTPM_COUNT (0)
    /* @brief LPUART availability on the SoC. */
    #define FSL_FEATURE_SOC_LPUART_COUNT (0)
    /* @brief LTC availability on the SoC. */
    #define FSL_FEATURE_SOC_LTC_COUNT (0)
    /* @brief LPI2C availability on the SoC. */
    #define FSL_FEATURE_SOC_LPI2C_COUNT (0)
    /* @brief LPSPI availability on the SoC. */
    #define FSL_FEATURE_SOC_LPSPI_COUNT (0)
    /* @brief LPIT availability on the SoC. */
    #define FSL_FEATURE_SOC_LPIT_COUNT (0)
    /* @brief MC availability on the SoC. */
    #define FSL_FEATURE_SOC_MC_COUNT (0)
    /* @brief MCG availability on the SoC. */
    #define FSL_FEATURE_SOC_MCG_COUNT (1)
    /* @brief MCGLITE availability on the SoC. */
    #define FSL_FEATURE_SOC_MCGLITE_COUNT (0)
    /* @brief MCM availability on the SoC. */
    #define FSL_FEATURE_SOC_MCM_COUNT (1)
    /* @brief MMAU availability on the SoC. */
    #define FSL_FEATURE_SOC_MMAU_COUNT (0)
    /* @brief MMDVSQ availability on the SoC. */
    #define FSL_FEATURE_SOC_MMDVSQ_COUNT (0)
    /* @brief MPU availability on the SoC. */
    #define FSL_FEATURE_SOC_MPU_COUNT (1)
    /* @brief MSCAN availability on the SoC. */
    #define FSL_FEATURE_SOC_MSCAN_COUNT (0)
    /* @brief MSCM availability on the SoC. */
    #define FSL_FEATURE_SOC_MSCM_COUNT (1)
    /* @brief MTB availability on the SoC. */
    #define FSL_FEATURE_SOC_MTB_COUNT (0)
    /* @brief MTBDWT availability on the SoC. */
    #define FSL_FEATURE_SOC_MTBDWT_COUNT (0)
    /* @brief MU availability on the SoC. */
    #define FSL_FEATURE_SOC_MU_COUNT (0)
    /* @brief NFC availability on the SoC. */
    #define FSL_FEATURE_SOC_NFC_COUNT (0)
    /* @brief OPAMP availability on the SoC. */
    #define FSL_FEATURE_SOC_OPAMP_COUNT (0)
    /* @brief OSC availability on the SoC. */
    #define FSL_FEATURE_SOC_OSC_COUNT (1)
    /* @brief OSC32 availability on the SoC. */
    #define FSL_FEATURE_SOC_OSC32_COUNT (0)
    /* @brief OTFAD availability on the SoC. */
    #define FSL_FEATURE_SOC_OTFAD_COUNT (0)
    /* @brief PDB availability on the SoC. */
    #define FSL_FEATURE_SOC_PDB_COUNT (2)
    /* @brief PGA availability on the SoC. */
    #define FSL_FEATURE_SOC_PGA_COUNT (0)
    /* @brief PIT availability on the SoC. */
    #define FSL_FEATURE_SOC_PIT_COUNT (1)
    /* @brief PMC availability on the SoC. */
    #define FSL_FEATURE_SOC_PMC_COUNT (1)
    /* @brief PORT availability on the SoC. */
    #define FSL_FEATURE_SOC_PORT_COUNT (5)
    /* @brief PWM availability on the SoC. */
    #define FSL_FEATURE_SOC_PWM_COUNT (2)
    /* @brief PWT availability on the SoC. */
    #define FSL_FEATURE_SOC_PWT_COUNT (0)
    /* @brief PCC availability on the SoC. */
    #define FSL_FEATURE_SOC_PCC_COUNT (0)
    /* @brief QuadSPIO availability on the SoC. */
    #define FSL_FEATURE_SOC_QuadSPIO_COUNT (0)
    /* @brief RCM availability on the SoC. */
    #define FSL_FEATURE_SOC_RCM_COUNT (1)
    /* @brief RFSYS availability on the SoC. */
    #define FSL_FEATURE_SOC_RFSYS_COUNT (1)
    /* @brief RFVBAT availability on the SoC. */
    #define FSL_FEATURE_SOC_RFVBAT_COUNT (1)
    /* @brief RNG availability on the SoC. */
    #define FSL_FEATURE_SOC_RNG_COUNT (0)
    /* @brief RNGB availability on the SoC. */
    #define FSL_FEATURE_SOC_RNGB_COUNT (0)
    /* @brief ROM availability on the SoC. */
    #define FSL_FEATURE_SOC_ROM_COUNT (0)
    /* @brief RSIM availability on the SoC. */
    #define FSL_FEATURE_SOC_RSIM_COUNT (0)
    /* @brief RTC availability on the SoC. */
    #define FSL_FEATURE_SOC_RTC_COUNT (0)
    /* @brief SCI availability on the SoC. */
    #define FSL_FEATURE_SOC_SCI_COUNT (0)
    /* @brief SDHC availability on the SoC. */
    #define FSL_FEATURE_SOC_SDHC_COUNT (0)
    /* @brief SDRAM availability on the SoC. */
    #define FSL_FEATURE_SOC_SDRAM_COUNT (0)
    /* @brief SIM availability on the SoC. */
    #define FSL_FEATURE_SOC_SIM_COUNT (1)
    /* @brief SMC availability on the SoC. */
    #define FSL_FEATURE_SOC_SMC_COUNT (1)
    /* @brief SPI availability on the SoC. */
    #define FSL_FEATURE_SOC_SPI_COUNT (0)
    /* @brief SCG availability on the SoC. */
    #define FSL_FEATURE_SOC_SCG_COUNT (0)
    /* @brief SEMA42 availability on the SoC. */
    #define FSL_FEATURE_SOC_SEMA42_COUNT (0)
    /* @brief TMR availability on the SoC. */
    #define FSL_FEATURE_SOC_TMR_COUNT (0)
    /* @brief TPM availability on the SoC. */
    #define FSL_FEATURE_SOC_TPM_COUNT (0)
    /* @brief TRIAMP availability on the SoC. */
    #define FSL_FEATURE_SOC_TRIAMP_COUNT (0)
    /* @brief TRNG availability on the SoC. */
    #define FSL_FEATURE_SOC_TRNG_COUNT (1)
    /* @brief TSI availability on the SoC. */
    #define FSL_FEATURE_SOC_TSI_COUNT (0)
    /* @brief TRGMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_TRGMUX_COUNT (0)
    /* @brief TSTMR availability on the SoC. */
    #define FSL_FEATURE_SOC_TSTMR_COUNT (0)
    /* @brief UART availability on the SoC. */
    #define FSL_FEATURE_SOC_UART_COUNT (5)
    /* @brief USB availability on the SoC. */
    #define FSL_FEATURE_SOC_USB_COUNT (0)
    /* @brief USBDCD availability on the SoC. */
    #define FSL_FEATURE_SOC_USBDCD_COUNT (0)
    /* @brief USBHSDCD availability on the SoC. */
    #define FSL_FEATURE_SOC_USBHSDCD_COUNT (0)
    /* @brief USBPHY availability on the SoC. */
    #define FSL_FEATURE_SOC_USBPHY_COUNT (0)
    /* @brief VREF availability on the SoC. */
    #define FSL_FEATURE_SOC_VREF_COUNT (0)
